Revit 2026 API

# DefinitionBindingMapIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DefinitionBindingMapIterator()
```
```vb
Public Sub New
```
```cpp
public:
DefinitionBindingMapIterator()
```
```fsharp
new : unit -> DefinitionBindingMapIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

DefinitionBindingMapIterator Class

Autodesk.Revit.DB Namespace